tutorialsDrift/laminar/1DSimpleShear/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 18;

vertices        
(
    (-0.005 0   0.005) //0
    ( 0.005 0   0.005) //1
    ( 0.005 1.  0.005) //2
    (-0.005 1.  0.005) //3
    (-0.005 0  -0.005) //4
    ( 0.005 0  -0.005) //5
    ( 0.005 1. -0.005) //6
    (-0.005 1. -0.005) //7
);

blocks          
(
    hex (0 1 5 4 3 2 6 7) (1 1 72) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    inlet 
    {
     type   cyclic;
     neighbourPatch outlet;
     faces ((0 3 7 4));
    }
    outlet
    {
     type   cyclic;
     neighbourPatch  inlet;
     faces  ((1 5 6 2));
    }
    top
    { 
     type wall;
        faces ((7 6 2 3));
    }
    bottom 
    {
     type wall;
     faces ((0 4 5 1)); 
    }
    frontAndBackPlanes
    {
    type empty;
    faces (
           (0 1 2 3)
           (4 7 6 5)
          );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
